{
  "https://wizzair.com/en-gb/information-and-services/booking-information/how-to-book": "How to book\nFAQ\nstart booking now\n\nONLINE\n\n\n\nSimple travel? Book directly with WIZZ website!\n\ndownload\n\nMOBILE APP\n\nDownload the FREE Wizz Air mobile app! It has everything you need for flying!\ncall centre numbers\n\nCALL CENTRE\n\n\n\n  ‎€15.00 Call Centre Transaction Fee\n\nYou can also book through travel agents and at most airport sales desks.\n\nCONFIRMATION CODE\nAfter you have completed your booking, you will receive a confirmation code – this is what you need for check-in.\n\nA travel itinerary will be sent to your email address, which includes\n\na unique confirmation code\nflight number\nthe date and time of travel\ndeparture and destination details\nfull cost\nFor passengers booking flights via a travel agency or a third-party website, the itinerary will be provided by the travel agent. If the reservation was created not by you, any flight related changes will be communicated to the contact details of the booking owner.\n\nCLOSE\nBOOKING ONLINE\nThe cheapest and fastest way of booking a seat. Simply search for your flight on our home page and follow the steps.\n\nFill out the necessary information when prompted:\n\npassenger details\ncontact information\npayment information\nAt the end of the process, you will be provided a travel itinerary.\nTo book online, you must be at least 18 years old.\n\nRelated\nDownload the free Wizz Air mobile app to your phone to book easily on the go! Available for Android, iPhone and as an Amazon app!\nCLOSE\nBOOKING BY APP\nDownload the WIZZ mobile application and stay informed through your whole journey.\nEnable automatic push notifications to get the latest information about the status of your booked flight (e.g. if the flight has a delay).\nScan this QR code to download the app and enjoy all the benefits.\n\nQR-code-mainpagebadge-apple-app-store badge-google-play\n\nSIMPLE SEARCHING AND BOOKING\nWhat could be better than low flight prices? Booking those flights in the easiest, most practical way possible!\n\nADD SERVICES\nWant to add more luggage or change your reserved seat? No worries, you can add most travel-related services through the app. Wizz Air’s exclusives are also available in the mobile app: WIZZ Discount Club, Privilege Pass, WIZZ Flex, etc.\n\nSET YOUR MOST IMPORTANT REMINDERS\nSet a price alert to get automatic push notifications about our latest fare changes or the status of your booked flight.\n\nSHARING\nLet all your friends know about the adventures you’re planning. Share your flight searches or send co-travelers their boarding passes.\n\nMOBILE CHECK-IN\nNo printing is needed! Use your paperless confirmation to check-in*! *only at airports with permitted access.\n\nTIMELINE AND FLIGHT STATUS\nCheck out your flight schedule and review your bookings with all the important milestones of your flight. With the timeline function of the renewed Wizz Air app, it’s fun to track and fun to travel. And if you still want to know more about your flight, you can track your plane in real-time.\n\nSCAN DOCUMENTS\nNo need for typing in endless numbers and data. Simply scan your documents for a much faster booking and check-in process.\n\nGREEN PASS\nScan your QR code of their EU COVID-19 digital certificate when checking in and the status will be displayed on your boarding pass IN-APP BOARDING CARD No need to print or download your ticket to your Passbook. Just grab your phone and use the in-app boarding card, even offline.\n\nWIZZ MAGAZINE\nBefore you board your plane, check out the in-app magazine or the WIZZ Café&Boutique.\n\nWIZZ RIDE\nWe took things one step further and made sure you have a ride after your flight. Book a cab for when you arrive at your destination with WIZZ Ride.\n\nPROFILE HANDLING\nYou can register, modify and easily manage the details of your profile.\n\nLANGUAGES\nBulgarian, German, English, Hungarian, Italian, Polish, Romanian, Russian, Spanish, Swedish, Ukrainian, Dutch, French, Lithuanian, Serbian, Bosnian, Arabic.\n\nCLOSE\nBOOKING BY PHONE\nYou can call the Wizz Air Call Centre on country-specific premium numbers.\n\nA Call Centre Transaction Fee will be charged if you book through the Wizz Air Call Centre. This Call Centre Transaction Fee is not refundable. Please check the fee by clicking here.\n\nRelated\n\nCall Centre\n\nCLOSE\nPAYMENTS\nYou can pay in a number of different ways:\n\nwith credit or debit cards (Visa, Visa Electron, MasterCard and Maestro)\nvia bank transfer\nusing your balance on your WIZZ Account\nusing WIZZ vouchers\nRelated\nFor further details on payment methods, please go to the Payments page!\nCLOSE\nFARES, TAXES, CHARGES AND OTHER FEES\nOur one-way prices include taxes, administration and other non-optional charges, as well as the price of your hand luggage (40 x 30 x 20 cm, max. 10 kg).\n\nCLOSE\nONWARD FLIGHTS\nWe carry passengers directly between two cities. We don’t offer a flight connection service, therefore you will need to check in with your luggage for each separate journey.\n\nAllow sufficient time between the arrival time of the incoming flight and the departure time of the onward flight for collecting your checked-in baggage and completing the check-in and security control procedures for your next flight.\nCLOSE\nNOTIFICATIONS\nThe contact information you provided when making the reservation might be used for sending notifications regarding flight changes. We need the following contact information\n\ntelephone number/mobile telephone number\nemail address\nIf the reservation was made by a travel agent or via a third-party website and no email address was provided for the passenger, then the travel agent’s own email address will be used for notifications. It is responsibility of the travel agent to forward you this information.\n\nWizz Air is not liable for any damages arising from cases where the e-mail address and/or telephone number provided was inaccurate, or if the passenger did not have access to, or failed to regularly check, the e-mail address provided or if the passenger was not reachable on any of the telephone numbers provided.\n\nCLOSE\nFrequently asked questions\nINFO\nIS IT SAFE TO BOOK A TICKET ONLINE?\nWe do our best to protect and safely store your personal data, preventing unauthorised access, utilisation, tampering or deletion. We pay special attention to the safe transmission of personal and financial data through encrypted channels using state-of-the-art Secure Socket Layer (SSL) technology.\n\nWe also offer an online security service for VISA and MasterCard holders. Verified by VISA and MasterCard Secure Code schemes enable you to register an additional password to your credit card so as to prevent unauthorised purchases on your credit card.\n\nDuring check-out – if your bank is participating – you will be asked to register for one of the schemes. Simply follow the online instructions to set up your additional password. Some banks do offer an option to sign up later, others will ask you to sign up immediately when completing your online transaction. These schemes will soon become compulsory for all cardholders. If you have any questions, please contact your card issuer directly.\n\nDid you find this helpful? YES | NO\nCLOSE\nCAN I BOOK CONNECTING FLIGHTS?\nWizz Air does not operate connecting flights and cannot facilitate the transfer of passengers or their baggage to other flights (whether operated by Wizz Air or other carriers). For this reason, we cannot accept liability for any missed onward flights.\n\nIf you book several Wizz Air flights on the same day, they are not considered as connecting flights. You will need to pick up your baggage, exit the transit area, go to check-in, drop the baggage, proceed to security, immigration again for the next flight. Make sure to have valid travel documents for all the countries you arrive in/depart from.\n\nPlease allow sufficient time between the scheduled time of arrival of your incoming flight and the scheduled time of departure of your onward flight.\n\nDid you find this helpful? YES | NO\nCLOSE\nI HAD ALMOST FINISHED THE BOOKING WHEN I RECEIVED THE MESSAGE \"SESSION EXPIRED\". WHAT DOES IT MEAN?\nFor security reasons the time limit for making a reservation is 30 minutes. The system logs off automatically when you reach the time limit. If this message occurs at the end of the booking process, please contact the Wizz Air Call Centre, quoting the date of departure and route, to check if your reservation was completed successfully.\n\nDid you find this helpful? YES | NO\nCLOSE\nWHAT SHOULD I DO IF TWO PASSENGERS WITHIN ONE RESERVATION HAVE THE SAME NAME (E.G. FATHER AND SON)?\nPlease add \"Jr\" (meaning junior) after the younger passenger's last name, so that the system will allow you to book the flight. Example: 1. Smith / John; 2. Smith Jr / John.\n\nDid you find this helpful? YES | NO\nCLOSE\nWHICH TRANSACTIONS ARE CHARGED WITH THE CALL CENTRE TRANSACTION FEE?\nTo all transactions that are available online, an additional Call Centre Transaction Fee will apply in case they are requested via the Call Centre. This Call Centre Transaction Fee is not refundable.\n\nExceptions: The Call Centre Transaction Fee does not apply to the following requests:\n\nadd a child to an existing booking\nadd an infant to an existing booking\nadd infant on a separate seat (with a car seat) to an existing booking\nadd a musical instrument to existing booking\nchange flight’s date, time, route for only part of the passengers\nadd extra seat if they are travelling with a broken leg that cannot bend\nrequest Meet and Assist support to an existing booking\nseat allocation for PRM (passengers with reduced mobility)\nadd a guide dog\nPOC equipment\nflight correction\ninvoice correction\npaper invoice\nDid you find this helpful? YES | NO\nCLOSE\nMY PARTNER AND I JUST BOOKED A FLIGHT BUT WE WILL HAVE GOTTEN MARRIED BY THE TIME WE TRAVEL AND THE BOOKING CONTAINS MY WIFE’S MAIDEN NAME. WHAT SHALL WE DO?\nA name change will be necessary, which is free of charge if travel documents and the marriage certificate are provided.\n\nPlease contact us by submitting a Complaints form on our website as soon as possible. We will contact you with details on where to send the required documents. It may take up to 30 days to answer your e-mail. If your request is urgent, we recommend contacting the Wizz Air Call Centre for a free name correction.\n\nDid you find this helpful? YES | NO\nCLOSE",
  "https://wizzair.com/en-gb/information-and-services/booking-information/check-in-and-boarding": "Check-in and boarding\nFAQ\nonline\n\nONLINE\nFREE\nprint your own boarding card \navailable based on your seat selection\nup to 3 hours before departure\n\n\n\nMOBILE APP\nFREE\nuse mobile boarding pass\ninstead of a boarding card\n\n\nairport\n\nAIRPORT\nPAID*\nreceive boarding card at the airport\n\n(cheaper if purchased in advance)\n\n*Online and Mobile check-in may not be available at some airports.\nIn these cases Airport check-in is offered free of charge.\n\nONLINE CHECK-IN\nTo reduce costs and keep our fares cheap, we offer free online check-in options. Online check-in is available from 30 days up to 3 hours before the scheduled departure time if you have purchased a seat during your booking.\n\nIn case you have not purchased any seats with your booking, check-in will become available only 48 hours before departure.\n\ncheck in online\nprint your boarding card\npresent the printed boarding card at the gate with your travel documents no later than 30 minutes before the scheduled departure time\nif you hold non-EU travel documents, you need to present yourself at the check-in counter to have your documentation checked and your boarding card stamped\nif you have baggage to drop off, go to the baggage drop desk no later than 40 minutes prior to departure or according to the local rules as indicated in the below “CHECK-IN TIMES” section.\nIf you are travelling within the Schengen area you don’t need to fill in the travel document details during the online check-in procedure, since you are not required to provide such details.\n\nDuring the online check-in process you might be requested to provide visa details on certain routes. If no visa is required for your destination, just fill in the field with xxxxx characters.\n\nChildren under 14 need to be accompanied and checked in online by a passenger older than 16.\n\nYou can change your reservation (except for the flight and the name) or purchase additional services even after the online check-in.\n\nCLOSE\nMOBILE CHECK-IN\nDownload our free mobile app for Android, iPhone!\n\nQR-code-mainpage badge-apple-app-store badge-google-play\n\nNo printing needed, choose the more sustainable option and get paperless confirmation of your booking. **\n\nIf you check in with the app, you have the following options:\n\nretrieve your boarding pass via the app when your phone is connected to the internet\nvisit wizzair.com from your mobile's browser, enter your flight confirmation code and print your boarding pass\nIf you are using iOS operating system, you can also save your boarding card to the Wallet*\nSelect airport to check mobile boarding card availability\n\nSome airports do not yet support mobile boarding passes. In such cases, a mobile boarding pass will not be generated and you will need to visit wizzair.com, retrieve your reservation and print your boarding card.\n\n\nFROM\n\nTO\nSelect airport to check mobile boarding card availability\n\n*Wallet is a native Apple iPhone and iPod touch app that was introduced as part of iOS 9. This app allows users to store and use electronic coupons, airline boarding passes, train tickets, movie and other event tickets, reward club cards and gift cards.\n**Only at airports with permitted access.\n\nCLOSE\nAIRPORT CHECK-IN\nYou can check in at the airport for a fee.\n\nPay at the time of booking.\nAdd at a later time on your flight summary page.\nIf online check-in services are not yet available from your departure airport, airport check-in will be free until the service becomes available.\n\nList of airports where online check-in is not available and airport check-in is free of charge:\n\nTirana (to Budapest only)\nZaragoza\nMoscow\nMarrakesh Menara Airport\nAgadir Al Massira Airport\nBaggage drop off usually closes 40 minutes before scheduled departure time. In some cases, the airport check-in desk closes earlier. Please find below the list of airports with earlier closing times:\n\nBucharest Henri Coandă International Airport – 60 minutes before scheduled time of departure\nEindhoven Airport – 50 minutes before scheduled time of departure\nBudapest Airport (for TLV and PRN routes only) – 60 minutes before scheduled time of departure\nMálaga Airport – 50 minutes before scheduled time of departure\nDubai International Airport – 60 minutes before schedule time of departure\nMilan–Malpensa Airport – 60 minutes before scheduled time of departure\nLondon Luton – 60 minutes before scheduled time of departure\nTel-Aviv Ben Gurion Airport - 60 minutes before scheduled time of departure\nMarrakesh Menara Airport – 60 minutes before scheduled time of departure\nOvda Airport – 60 minutes before scheduled time of departure\nAgadir Al Massira Airport - 60 minutes before scheduled time of departure\nWarsaw Airport (for TLV route only) – 60 minutes before scheduled time of departure\nMalé-Velana Airport – check-in opens at 180 minutes and closes 60 minutes before scheduled time of departure.\nCLOSE\nCHECK-IN TIMES\nOnline check-in\n\nAvailability of online check-in is based on your seat selection:\n\nIf you have purchased a seat during or after your booking: 30 days before your flight\nIf you have no seat purchased: 48 hours before your outbound flight\nAirport check-in\n\nCheck-in starts 2 hours and closes 40 minutes before departure. In some cases, the airport check-in desk closes earlier. Please find below the list of airports with earlier closing times:\n\nBerlin Brandenburg Airport - check-in opening 165 minutes and closing 60 minutes before scheduled time of departure\nBucharest Henri Coandă International Airport – 50 minutes before scheduled time of departure\nEindhoven Airport – 50 minutes before scheduled time of departure\nBudapest Airport (for TLV and PRN routes only) – 60 minutes before scheduled time of departure\nMálaga Airport – 50 minutes before scheduled time of departure\nDubai International Airports (DXB and DWC) – 50 minutes before scheduled time of departure\nMilan–Malpensa Airport (for non-Schengen routes only: KUT, SKP, TGD) – 50 minutes before scheduled time of departure\nLondon Luton – check-in opens 3 hours and closes 60 minutes before scheduled time of departure\nTel-Aviv Ben Gurion Airport - 60 minutes before scheduled time of departure\nAbu Dhabi International Airport - 60 minutes before scheduled time of departure\nTbilisi International Airport – 60 minutes before scheduled time of departure\nVienna International Airport (AUH, DXB, RUH, JED, KWI and DMM) - check-in opening 180 minutes and closing 60 minutes before scheduled time of departure\nAbu Dhabi International Airport - check-in opening 180 minutes and closing 60 minutes before scheduled time of departure\nKing Abdulaziz International Airport - check-in opening 180 minutes and closing 60 minutes before scheduled time of departure\nKing Khalid International Airport - check-in opening 180 minutes and closing 60 minutes before scheduled time of departure\nKing Fahd International Airport - check-in opening 180 minutes and closing 60 minutes before scheduled time of departure\nThe check-in opens earlier at the following airports, to reduce the queueing time due to additional travel documents checks:\n\nAvram Iancu Cluj International Airport (check-in opens 3 hours before departure)\nSibiu International Airport (check-in opens 3 hours before departure)\nIf you have special requests, special needs or travel with pre-booked assistance, please check in 2 hours prior to the scheduled time of departure to make sure that we can complete the check-in procedure on time.\n\nCLOSE\nPROHIBITED ITEMS ONBOARD\nYou can not bring the following items onboard the aircraft or in airport security restricted areas in the airport.\n\nBy proceeding with check-in, you accept you have also read and understood the following list of prohibited items in cabin baggage.\n\nNOT PERMITTED IN THE CABIN\n\nWorkman's tool (tools capable of being used either to cause serious injury or to threaten the safety of aircraft), including:\ncrowbars\ndrills and drill bits, including cordless portable power drills\ntools with a blade or a shaft of more than 6 cm capable of use as a weapon, such as screwdrivers and chisels\nsaws, including cordless portable power saws\nblowtorches\nbolt guns and nail guns\n\nObjects with a sharp point or sharp edge (objects with a sharp point or sharp edge capable of being used to cause serious injury), including:\nitems designed for chopping, such as axes, hatchets and cleavers\nice axes and ice picks\nrazor blades\nbox cutters\nknives with blades of more than 6 cm\nscissors with blades of more than 6 cm as measured from the fulcrum\nmartial arts equipment with a sharp point or sharp edge\nswords and sabres\n\nStunning devices (devices designed specifically to stun or immobilise), including:\ndevices for shocking, such as stun guns, tasers and stun batons\nanimal stunners and animal killers\ndisabling and incapacitating chemicals, gases and sprays, such as mace, pepper sprays, capsicum sprays, tear gas, acid sprays and animal repellent sprays\n\nBlunt objects (objects capable of being used to cause serious injury when used to hit), including:\nbaseball and softball bats\nclubs and batons, such as billy clubs, blackjacks and night sticks\nmartial arts equipment\nNOT PERMITTED IN THE CABIN AND BAGGAGE\n\nExplosives and incendiary substances and devices (explosives and incendiary substances and devices capable, or appearing capable, of being used to cause serious injury or to pose a threat to the safety of aircraft), including:\nammunition\nblasting caps\ndetonators and fuses\nreplica or imitation explosive devices\nmines, grenades and other explosive military stores\nfireworks and other pyrotechnics\nsmoke-generating canisters and smoke-generating cartridges\ndynamite, gunpowder and plastic explosives\n\nGuns, firearms and other devices that discharge projectiles (devices capable, or appearing capable, of being used to cause serious injury by discharging a projectile), including:\nfirearms of all types, such as pistols, revolvers, rifles, shotguns\ntoy guns, replicas and imitation firearms capable of being mistaken for real weapons\ncomponent parts of firearms, excluding telescopic sights\ncompressed air and CO 2 guns, such as pistols, pellet guns, rifles and ball bearing guns\nsignal flare pistols and starter pistols\nbows, cross bows and arrows\nharpoon guns and spear guns\nslingshots and catapults\n\nFire extinguisher\n\nFireworks\n\nFuel\n\nCamping stove cylinders\n\nBatteries\n\nPaint\nCLOSE\nMISSING THE CHECK-IN OR BOARDING\nIf you fail to:\n\ncomplete check-in procedures by the deadline\nshow up at check-in or at the boarding gate in due time\nyour reservation will be cancelled and you won't be able to board.We will refund the amount of the total fare after deducting the amounts of the fee for other services and a seat protection fee of ‎€85.00.\n\nWe suggest purchasing insurance to cover your losses in such cases.\n\nRelated\n\nRefund\n\nSecurity Fast Track\n\nPriority Boarding\n\nCLOSE\nBOARDING\nYou need to be present at the boarding gate no later than 30 minutes before the scheduled departure time.\n\nDocuments\nYou need to present the same travel documents you used for the online check-in at airport security and the boarding gate.\n\nPlease make sure that you possess all necessary travel documents, such as your passport and visa. If you are not sure what the exact entry requirements are for your destination, please check with the relevant foreign office in your country before travelling. We can't take responsibility if you are denied boarding due to the lack of necessary travel documents.\n\nIf you are travelling with an infant, you need to print and present the infant's boarding card at the gate.\n\nGate\nThe airport information screens will tell you which gate you need to go to after check-in and security control. If you use airport check-in, the ground staff may be able to give you information about which gate you need to go to.\n\nDuty-free items\nItems you purchased after check-in and security checks can be taken on board. \n\nRelated\n\nPriority Boarding\n\nCLOSE\nFrequently asked questions\nINFO\nDO I HAVE TO PRINT THE CONFIRMATION E-MAIL OR MY TRAVEL PLAN AND PRESENT IT DURING CHECK-IN?\nNo. You only need to print and present your boarding card if you are checked-in online. If online check-in is unavailable from your departure airport you need to go to the airport check-in desk and present your travel document only (passport or personal identity document).\n\nDid you find this helpful? YES | NO\nCLOSE\nI PROVIDED MY NATIONAL ID NUMBER DURING ONLINE CHECK-IN AND PRINTED MY BOARDING PASS. CAN I TRAVEL WITH MY PASSPORT INSTEAD?\nYou need to present the same travel document you checked in with online at the airport too. If you provided your national ID number during check-in, you cannot travel with your passport and vice versa. \n\nDid you find this helpful? YES | NO\nCLOSE\nI DID NOT HAVE TO PROVIDE TRAVEL DOCUMENT DETAILS DURING MY ONLINE CHECK-IN. WHY?\nIf you are travelling within the Schengen area, you don’t need to fill in your travel document details. Simply complete the online check-in procedure. You will need to travel with your national ID or your passport, but providing travel document details is not required. \n\nDid you find this helpful? YES | NO\nCLOSE\nI TRIED TO CHECK IN ONLINE BUT COULDN'T. WHAT SHALL I DO?\nOnline check-in is available from 30 days up to 3 hours before the scheduled departure time if you have purchased a seat during your booking. In case you have not purchased any seats with your booking, check-in will become available only 48 hours before departure for each separate flight.\n\nYou can also download the Wizz Air mobile application and check-in through the app. For some locations, online check-in isn't available. In these special cases, you can check in at the airport free of charge. If you are still having trouble with checking-in, please contact the Wizz Air Call Centre!\n\nDid you find this helpful? YES | NO\nCLOSE\nI TRIED TO CHECK IN USING MY MOBILE APP, BUT IT SAYS THAT THE AIRPORT CANNOT ACCEPT MOBILE BOARDING CARDS YET. WHAT SHOULD I DO?\nPlease use wizzair.com to print your boarding card and bring it with you to the airport!\n\nDid you find this helpful? YES | NO\nCLOSE\nI CHECKED IN FOR MY OUTBOUND FLIGHT, BUT I CAN NOT CHECK IN FOR THE RETURN, WHY ?\nIf you do not have assigned seats on the return flight, check-in will be open up to 48 hours before flight departure.\nDid you find this helpful? YES | NO\nCLOSE\nI HAVE ENTERED WRONG DETAILS OF MY TRAVEL DOCUMENTS DURING ONLINE CHECK-IN. WHAT SHALL I DO ?\nWhen you check-in online, make sure to enter the details of your travel documents accurately. If you made any mistake, for corrections please contact the Wizz Air Call Centre.\n\n \n\nDid you find this helpful? YES | NO\nCLOSE\nDO I ALWAYS HAVE TO PAY FOR AIRPORT CHECK-IN?\nAirport check-ins can be purchased during or after booking by adding Airport check-in to your reservation on your Travel plan page or via the Wizz Air Call Centre. Airport check-in is subject to a fee, payable per passenger and per flight. Airport check-in purchased at the airport is subject to a higher fee.\n\nIf online check-in is not yet available from your departure airport, airport check-in will be free of charge until the service becomes available.\n\nDid you find this helpful? YES | NO\nCLOSE\nI BOOKED AN EXTRA SEAT FOR MY MUSICAL INSTRUMENT. CAN I CHECK IN ONLINE?\nYes. You should check in your musical instrument with the same travel document details you used for your own check-in.\n\nDid you find this helpful? YES | NO\nCLOSE\nDOES MY SMALL CHILD NEED TO BE CHECKED IN?\nIf you are travelling with an infant, he or she also needs to be checked in with a printed boarding card. If the boarding card of the infant is missing, please contact the Wizz Air Call Centre.\n\nDid you find this helpful? YES | NO\nCLOSE\nHOW DO I CHECK IN MY BAGGAGE AT THE AIRPORT IF I ALREADY CHECKED IN ONLINE?\nYou can check in online as usual. If you're travelling with baggage that you need to check in, go to the baggage drop desk no later than 40 minutes before the departure of your flight.\n\nMake sure you have a printed boarding card, otherwise you will be required to pay an airport check-in fee. Some airport check-in desks function as baggage drop desks too.\n\nDid you find this helpful? YES | NO\nCLOSE\nCAN I MAKE CHANGES TO MY RESERVATION OR PURCHASE SERVICES AFTER I CHECKED IN ONLINE?\n \n\nYou can add additional services to your reservation even after check-in. If you added Priority Boarding or Seat Selection to the reservation, you need to\n\n- reprint the boarding card or\n\n- proceed to the check-in desk at the airport to receive a sticker reflecting the changes on the existing boarding card.\n\nYou can also change the flight and the name of the passenger up to 4 hours before departure online or via the Wizz Air Call Centre. You will be required to pay a fee for the change. If you request the change via the Wizz Air Call Center a transaction fee will be charged as well. This Call Centre Transaction fee is not refundable.\n\nIf you would like to change the flight’s date, time or route for only some of the passengers in the booking, you need to contact the Call Center for assistance. In this case the Call Center transaction fee does not apply.\n\nPlease note, if you have changed your flight or the passenger's name, you will need to check in again and reprint your boarding pass.\n\n \n\nDid you find this helpful? YES | NO\nCLOSE",
  "https://wizzair.com/en-gb/information-and-services/booking-information/changing-your-reservation": "Changing your reservation\nFlight change\n\nFLIGHT CHANGE\nChange the date, the time or the route\n\nbilling_as_company\n\nPASSENGER CHANGE\nModify the passengers in the reservation\n \n\nseat_allocation_assigned\n\nSERVICE CHANGE\nChange or purchase additional services even after your online check-in!\n\nComplete changes to the reservation up to 3 hours before the scheduled departure of the flight on the flight summary page online! In case Flexible Travel Partner service has been with the reservation, modifications to the reservation are only possible after finalising the names of all travel partners.\n\n\n\nCheck the applicable fees here\n\nAll services & fees\n\nFLIGHT CHANGES\nChanges to the reservation must be completed up to 3 hours prior to the scheduled departure time of the flight. Please note that the change will be considered completed once the payment (if applicable) is received. Please note that only credit card payment is possible.\n\nThe following modifications are possible:\na. In case of one-way reservations:\n\ni. The date, time and destination of the booked flight can be changed a maximum of 3 hours before the scheduled departure time of the flight. (The change must be completed up to 3 hours before the scheduled departure time of the flight.)\n\nb. In case of two-way reservations:\n\ni. If the reservation includes a return flight, the destinations must be changed in both cases, for both the original flight and the return flight. The first flight's origin airport cannot be different from the return flight's destination airport, likewise the first flight's destination cannot be different from the return flight's origin airport. (E.g. A reservation for Budapest – London Luton – Budapest can be changed to Warsaw – Barcelona – Warsaw, but not to Budapest – London Luton – Warsaw.)\n\nii. If the first flight has already departed, only the date and time of the return flight can be amended.\n\nc. Process of modifying reservations that include more than one passenger (no group reservations, 2-10 people)\n\nIn order to change the flight, please log into your Wizz Account\nSelect the reservation that you wish to modify\nSelect the passengers for whom the changes will apply (in case you wish to make the same modification for all passengers, you can select all passengers in the same process)\nProvide the details (date, time and route) of the new flight(s) for which you want to change the original flight(s).\nConfirm the change and settle payment for fare difference and flight change fees if applicable\nPlease note that in case the original reservation was fully or partially paid by WIZZ voucher, the modifications are possible only for all passengers and all flights at the same time.\nApplicable payments in case of flight change\n1. Fare difference: is the difference between the ticket price of the original and the new flight selected (including all fare types, such as Basic, WIZZ GO and WIZZ Plus)\n\nIf the ticket price of the new flight is higher than that of the original, the ticket price difference must be paid;\nIf the new ticket prices is lower than the original, passengers do not have to pay additional fees, however the ticket price difference will not be refunded;\nIf the original and the new flights' prices are the same, the passenger does not have to pay any fare difference;\n2. Flight change fee\n\nThe flight change fee is dependent on days left until departure, and is charged per passenger per flight in addition to the fare difference as per the below.\n\nMore than 30 days to go: 35€ per passenger per flight\nBetween 7 – 30 days to go: 40€ per passenger per flight\nWithin 7 days to go: 45€ per passenger per flight\nThose passengers who have purchased WIZZ Flex during the reservation of their original flight, will not need to pay for the flight change fee.\n\n3.Recovery of the WIZZ Discount Club benefits\n\nThe payable amount consists of the differences of the regular and WIZZ Discount Club ticket price and the regular and WIZZ Discount Club baggage fee. This fee is applicable for the passengers who are not travelling with the WIZZ Discount Club member following the flight change, therefore they will lose the WIZZ Discount Club benefits.\n\nAfter changing the flight, the passengers must ensure that they are checked in for the new flight and have their new boarding card.\nServices purchased from third parties during the reservation of the original flight (e.g. insurance, airport transfer) are not amended automatically during the flight change process. To change these services, please contact directly the provider offering the given services.\nPlease note that if a Flight change is requested via Wizz Air Call Centre, a Call Centre Transaction Fee will be charged.\n\nIt is not possible to add additional adult passengers to an existing booking, a new booking needs to be created.\n\nIt is possible to add an infant or a child to an already existing booking via the Wizz Air Call Centre only. In this case the Call Centre Transaction Fee will not be charged.\n\nCLOSE\nNAME CHANGES\nChange the name of the passenger online up to 3 hours before the scheduled time of departure!\n\nIt will be required to pay a name change fee of ‎€50.00 per flight:\n\nPlease note that if the name change is requested via the Wizz Air Call Centre, the Call Centre Transaction Fee will be charged.\n\nName change is free of charge online if a misspelled name or a typo needs to be corrected, such as:\n\nif there are maximum 3 characters to be changed in the name added to the booking\nif an abbreviated name needs to be extended an the (e.g.: John T. Smith) to a full name (e.g.: John Thomas Smith) in order to match the travel document\nif the gender (title) of the name added to the booking needs to be changed. It is possible to make only make one free name change correction in the booking.\nIn case first name and last name is mixed up, please contact the Wizz Air Call Centre for requesting the correction. This correction is free of charge and the Call Centre Transaction Fee will not be charged.\n\n\nCLOSE\nSERVICE CHANGES\nIt is possible to purchase additional services even after having checked in online!\nAfter purchasing additional services, the passengers must ensure that they are checked in for the new flight and have their new boarding card.\nCLOSE\nVOLUNTARY CANCELLATION\nCancellation of the reservation must be completed up to 3 hours prior to the scheduled departure time of the flight. Please note that the cancellation will be considered completed once the payment (if applicable) is received. Please note that only credit card payment is possible.\n\na. In case of one-way reservations: Cancellation of the reservation must be completed up to 3 hours prior to the scheduled departure time of the flight.\n\nb. In case of two-way reservations:\n\ni. If the reservation includes a return flight, the cancellation can be made before the departure of the first flight. In this case, both flights will be cancelled. For example, in case of a Budapest – London Luton – Budapest flight, the cancellation is possible before the departure of the Budapest – London Luton flight only. It this case the Budapest – London Luton and the London Luton – Budapest flights will be both cancelled.\n\nii. If the first flight has already departed, cancellation is not possible.\n\nTo cancel the reservation, please log in to and make a choice within your (reservation owner) WIZZ Profile. If you experience any difficulties, please contact the Wizz Air Call Centre.\n\nc. Process of cancelling reservations that include more than one passenger (no group reservations, 2-10 people)\n\nIn order to cancel the reservation, please log into your WIZZ Profile\nSelect the reservation that you wish to cancel\nSelect the passengers for whom the cancellation will apply (in case you wish to cancel the reservation for all passengers, you can select all passengers in the same process)\nConfirm the cancellation and settle payment related to the cancellation if applicable\nPlease note that in case the original reservation was fully or partially paid by WIZZ voucher, the cancellation of the reservation is possible only for all passengers and all flights at the same time.\nApplicable payments in case of cancellation of the reservation\n1. The cancellation fee is dependent on days left until departure, and is charged per passenger per flight as per the below.\n\nMore than 14 days to go, cancellation fee: ‎€65.00 per passenger per flight\nWithin 14 days to go, seat protection fee: ‎€85.00 per passenger per flight\nIf the cancellation is made more than 14 days prior to departure, the passenger is entitled to the refund of the total fare after the deduction of the cancellation fee and the Recovery of the WIZZ Discount Club benefits.\nIf the cancellation is made within 14 days prior to departure, the passenger is entitled to the refund of the total fare after the deduction of the seat protection fee, the Recovery of the WIZZ Discount Club benefits and Other Services\n2. Recovery of the WIZZ Discount Club benefits\n\nThe payable amount consists of the differences between the regular and WIZZ Discount Club ticket price and the regular and WIZZ Discount Club baggage fee. In case the WIZZ Discount Club member cancelled their reservation, these fees are applicable for the passengers remaining in the reservation, as they lose the WIZZ Discount Club benefits.\n\nThe cancellation fee and the Recovery of the WIZZ Discount Club benefits shall be deducted from the amount paid for the passenger whose reservation is cancelled, as follows:\n\nIf the amount paid for the passenger whose reservation is cancelled is higher than the fees related to the cancellation (cancellation fee/seat protection fee, Recovery of WIZZ Discount Club benefits), the difference will be refunded to the WIZZ Account of the booking owner (the person who originally created the booking) in WIZZ Credit;\nIf the amount paid for the passenger whose reservation is cancelled is lower than the fees related to the cancellation (cancellation fee/seat protection fee, Recovery of WIZZ Discount Club benefits), only the Recovery of the WIZZ Discount Club Benefits need to be paid.\nIf the amount paid for the passenger whose reservation is cancelled is equal to the fee related to the cancellation (cancellation fee/seat protection fee, Recovery of WIZZ Discount Club benefits), no payment shall be made and no refund is given\nFurther important information:\n\nIf a refund to a WIZZ Account is requested, all flights for all passengers included in the reservation will be cancelled and become invalid. After voluntary cancellation is performed online and WIZZ Account credit is requested, this process is irreversible and no further modification is possible. The WIZZ credits cannot be later converted to the original payment method.\n\nIn case you would like to receive the refundable amount to your debit/credit card, via bank transfer of any other payment method the original booking was paid with you have to contact the Wizz Air Call Centre (no online alternative yet). In this case, the Call Centre Transaction Fee will not be charged.\n\nPlease be advised that if you originally paid for your booking with WIZZ Account credits, you can request refund only in the form of WIZZ Credits – it is not possible to convert to another payment type.\n\nIf you purchased a Plus Fare ticket, or have a reservation with WIZZ Flex, you may request a refund of your purchase price. The purchase price of your reservation will be refunded to your WIZZ Account as credit. Please note that the purchase price of the WIZZ Flex service will not be refunded to your WIZZ Account and its value will be deducted from the full purchase price. Please note that if the cancellation of the reservation is done with WIZZ Flex, the rules of credit expiry are different, please check WIZZ Flex Terms and Conditions.\n\nAfter applying the respective fees, the refundable amount (if applicable) will be credited to the WIZZ Account of the booking owner in WIZZ Credit, within 72 hours of the request. The credited amount will be available on the WIZZ Account for 1 year (except for WIZZ Flex, where expiry is 90 days) and can be used for purchasing new Wizz Air flights and services.\n\nWIZZ Discount Club memberships and Privilege passes purchased during the reservation of the original flight will not be cancelled automatically with the cancellation of the reservation. Please check further details on WIZZ Discount Club and Privilege Pass.\n\nServices purchased from third parties during the reservation of the original flight (e.g. insurance, airport transfer) are not cancelled automatically during the cancellation of the reservation. To cancel these services, please contact directly the third party provider offering the given services.\n\nCLOSE"
}
